---
title: DoubleArray
classe: Autodesk.Revit.DB.DoubleArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DoubleArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `doubleArray.IsEmpty` | Boolean |
| `Double Item { get; set; }` | `doubleArray.Item` | Double |
| `Int32 Size { get; }` | `doubleArray.Size` | Int32 |
| `Void Append(Double&)` | `doubleArray.Append(item)` | Void |
| `Void Clear()` | `doubleArray.Clear()` | Void |
| `DoubleArrayIterator ForwardIterator()` | `doubleArray.ForwardIterator()` | DoubleArrayIterator |
| `IEnumerator GetEnumerator()` | `doubleArray.GetEnumerator()` | IEnumerator |
| `Void Insert(Double&, Int32)` | `doubleArray.Insert(item, index)` | Void |
| `DoubleArrayIterator ReverseIterator()` | `doubleArray.ReverseIterator()` | DoubleArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```